PICOVERAVR/pic/pic24/mcc_generated_files/traps.c
#include <xc.h>
#include "traps.h"

#define ERROR_HANDLER __attribute__((interrupt,no_auto_psv))
#define ERROR_HANDLER_NORETURN ERROR_HANDLER __attribute__((noreturn))
#define FAILSAFE_STACK_GUARDSIZE 8

#include <stdio.h>

/**
 * a private place to store the error code if we run into a severe error
 */
static uint16_t TRAPS_error_code = -1;

/**
 * Halts 
 * 
 * @param code error code
 */
void __attribute__((naked, noreturn, weak)) TRAPS_halt_on_error(uint16_t code)
{
    TRAPS_error_code = code;
#ifdef __DEBUG    
    __builtin_software_breakpoint();
    /* If we are in debug mode, cause a software breakpoint in the debugger */
#endif
    printf("Trap encountered - error code %d", TRAPS_error_code);
    while(1);
    
//    copied from header defn
//    TRAPS_OSC_FAIL = 0, /** Oscillator Fail Trap vector */
//    TRAPS_STACK_ERR = 1, /** Stack Error Trap Vector */
//    TRAPS_ADDRESS_ERR = 2, /** Address error Trap vector */
//    TRAPS_MATH_ERR = 3, /** Math Error Trap vector */
//    TRAPS_DMAC_ERR = 4, /** DMAC Error Trap vector */
//    TRAPS_HARD_ERR = 7, /** Generic Hard Trap vector */
//    TRAPS_DAE_ERR = 9, /** Generic Soft Trap vector */
//    TRAPS_DOOVR_ERR = 10, /** Generic Soft Trap vector */
    
}

/**
 * Sets the stack pointer to a backup area of memory, in case we run into
 * a stack error (in which case we can't really trust the stack pointer)
 */
inline static void use_failsafe_stack(void)
{
    static uint8_t failsafe_stack[32];
    asm volatile (
        "   mov    %[pstack], W15\n"
        :
        : [pstack]"r"(failsafe_stack)
    );
/* Controls where the stack pointer limit is, relative to the end of the
 * failsafe stack
 */    
    SPLIM = (uint16_t)(((uint8_t *)failsafe_stack) + sizeof(failsafe_stack) 
            - FAILSAFE_STACK_GUARDSIZE);
}

/** Oscillator Fail Trap vector**/
void ERROR_HANDLER_NORETURN _OscillatorFail(void)
{
    INTCON1bits.OSCFAIL = 0;  //Clear the trap flag
    TRAPS_halt_on_error(TRAPS_OSC_FAIL);
}
/** Stack Error Trap Vector**/
void ERROR_HANDLER_NORETURN _StackError(void)
{
    /* We use a failsafe stack: the presence of a stack-pointer error
     * means that we cannot trust the stack to operate correctly unless
     * we set the stack pointer to a safe place.
     */
    use_failsafe_stack(); 
    INTCON1bits.STKERR = 0;  //Clear the trap flag
    TRAPS_halt_on_error(TRAPS_STACK_ERR);
}
/** Address error Trap vector**/
void ERROR_HANDLER_NORETURN _AddressError(void)
{
    INTCON1bits.ADDRERR = 0;  //Clear the trap flag
    TRAPS_halt_on_error(TRAPS_ADDRESS_ERR);
}
/** Math Error Trap vector**/
void ERROR_HANDLER_NORETURN _MathError(void)
{
    INTCON1bits.MATHERR = 0;  //Clear the trap flag
    TRAPS_halt_on_error(TRAPS_MATH_ERR);
}
/** DMAC Error Trap vector**/
void ERROR_HANDLER_NORETURN _DMACError(void)
{
    INTCON1bits.DMACERR = 0;  //Clear the trap flag
    TRAPS_halt_on_error(TRAPS_DMAC_ERR);
}
/** Generic Hard Trap vector**/
void ERROR_HANDLER_NORETURN _HardTrapError(void)
{
    INTCON4bits.SGHT = 0;  //Clear the trap flag
    TRAPS_halt_on_error(TRAPS_HARD_ERR);
}
/** Generic Soft Trap vector**/
void ERROR_HANDLER_NORETURN _SoftTrapError(void)
{
    if(INTCON3bits.DAE)
    {
      INTCON3bits.DAE = 0;  //Clear the trap flag
      TRAPS_halt_on_error(TRAPS_DAE_ERR);
    }
    if(INTCON3bits.DOOVR)
    {
      INTCON3bits.DOOVR = 0;  //Clear the trap flag
      TRAPS_halt_on_error(TRAPS_DOOVR_ERR);
    }
    while(1);
}
